(function(window){
function  TextButtons2(){
   
}
TextButtons2.items = function(){
   var array = [];
   var obj = {};
   obj.title="עד התחתית";//1
   obj.label = "שולף הקלף שותה את כל מה שיש לו בכוס הבירה עד סופה (רצוי לעודד אותו בקריאות &quot;צ&apos;אג&quot;).";
   array.push(obj);
      obj = {};
   obj.title="צ'ייסר לכולם";//2
   obj.label = "כלל משתתפי המשחק שותים צ'ייסר.";
   array.push(obj);
   obj = {};
   obj.title="שתה ושלוף";//3
   obj.label = "שולף הקלף שותה צ'ייסר ושולף קלף נוסף.";
   array.push(obj);
   obj = {};
   obj.title="body shot";//4
   obj.label = "שולף הקלף בוחר משתתף אחר לעשות ממנו צ'ייסר מהפופיק, ללקק מלח מגופו ולהעביר לו לימון עם הפה.";
   array.push(obj);
   obj = {};
   obj.title="נחש את הצבע";//5
   obj.label = "שולף הקלף מנחש את צבע התחתונים של שאר משתתפי המשחק. משתתף שניחשו נכונה את צבע תחתוניו שותה צ'ייסר. על כל משתתף שטעו לגביו, שולף הקלף לוגם מהבירה.";
   array.push(obj);
   obj = {};
   obj.title="שנה כיוון";//6
   obj.label = "משנים את כיוון שליפת הקלפים.";
   array.push(obj);
   obj = {};
   obj.title="חוק חדש";//7
   obj.label = "על שולף הקלף להמציא חוק נוסף בנוסף לחוקי המשחק הקיימים.";
   array.push(obj);
   obj = {};
   obj.title="shoham bomb";//8
   obj.label = "שולף הקלף שותה צ'ייסר ומיד אחר כך שותה את כל הבירה שלו (רצוי לעודד אותו בקריאות צ'אג).";
   array.push(obj);
   obj = {};
   obj.title="צ'ייסר בלי ידיים";//9
   obj.label = "מניחים כוס צ'ייסר מלאה על השולחן ועל שולף הקלף לשתות אותו ללא שימוש בידיים.";
   array.push(obj);
   obj = {};
   obj.title="צ'אג או חובה";//10
   obj.label = "משתתפי המשחק בוחרים משימה לשולף הקלף. אם ברצונו לוותר על המשימה, עליו לשתות כוס בירה מלאה.";
   array.push(obj);
   obj = {};
   obj.title="twerk it baby";//11
   obj.label = "על שולף הקלף לבצע טוורק על האחרון ששתה צ’ייסר.";
   array.push(obj);
   obj = {};
   obj.title="משחקי הכס";//12
   obj.label = "שולף הקלף יושב על האחרון ששתה צ'ייסר למשך סיבוב שלם.";
   array.push(obj);
   obj = {};
   obj.title="drag queen";//13
   obj.label = "שולף הקלף בוחר משתתף אחר (ממין שונה) להחליף איתו בגדים עד סוף המשחק.";
   array.push(obj);
   obj = {};
   obj.title="קבל 3";//14
   obj.label = "על שולף הקלף לבצע את שלוש המשימות הבאות יחד עם שולפי הקלפים.";
   array.push(obj);
   obj = {};
   obj.title="משש ונחש";//15
   obj.label = "על שולף הקלף למשש את פניו של משתתף אחר בעיניים עצומות ולזהות אותו. אם טעה הוא שותה צ'ייסר, אם צדק שאר המשתתפים שותים צ'ייסר.";
   array.push(obj);
   obj = {};
   obj.title="foot massage";//16
   obj.label = "על שולף הקלף לעשות פוט מסאז’ למשתתף האחרון ששתה צ’ייסר למשך 30 שניות.";
   array.push(obj);
   obj = {};
   obj.title="נשיקה אסקימוסית";//17
   obj.label = " על שולף הקלף לעשות נשיקה אסקימוסית עם המשתתף האחרון ששתה צ'ייסר. יש לשמור על קשר עין!";
   array.push(obj);
   obj = {};
   obj.title="מרוץ שליחים";//18
   obj.label = "משתתפי המשחק מתחלקים לשתי קבוצות שוות (זוגיות הכל כוחות). ממלאים לכולם את כוסות הבירה עד הסוף ומתחילים תחרות שתיית בירה עם נציג אחד מכל קבוצה. ברגע שהנציג הראשון מסיים את הבירה שלו, הנציג הבא מקבוצתו שותה את הבירה שלו. כך ממשיכים עד שכלל חברי קבוצה אחת מסיימים את כל הבירה. על הקבוצה המפסידה לשבת בתחתונים לסיבוב שלם.";
   array.push(obj);
   obj = {};
   obj.title="you can leave your hat on";//19
   obj.label = " על שולף הקלף לרקוד על השולחן במשך 30 שניות לצלילי שיר שייבחר על ידי שאר המשתתפים";
   array.push(obj);
   obj = {};
   obj.title="lick the nipp’";//20
   obj.label = "על שולף הקלף ללקק פיטמה של משתתף אחר או לעשות שהם בומב.";
   array.push(obj);
   obj = {};
   obj.title="טובים השניים מן האחד";//21
   obj.label = "על שולף הקלף ועל המשתתף האחרון ששתה צ'ייסר לשתות בכל פעם שהשני שותה עד התור הבא.";
   array.push(obj);
   obj = {};
      obj.title="לא סוגרים עסק מצליח";//22
   obj.label = "על שולף הקלף לפתוח את הרוכסן של המשתתף האחרון ששתה צ'ייסר עם השיניים.";
   array.push(obj);
   obj = {};
   obj.title="באתי לעזרת חבר";//23
   obj.label = "שולף הקלף בוחר משתתף אחר לעשות צ'ייסר עם הרגליים שלו.";
   array.push(obj);
   obj = {};
   obj.title="body count";//24
   obj.label = "על שולף הקלף להצהיר עם כמה אנשים שכב או לסיים את המשקה שלו.";
   array.push(obj);
   obj = {};
   obj.title="יחסי מרות";//25
   obj.label = "על שולף הקלף להתקשר לחבר מהעבודה ולספר לו שהוא שכב עם הבוס. אם החבר מאמין, שאר המשתתפים שותים צ'ייסר. אם הוא לא מאמין, שולף הקלף שותה צ'ייסר. אם שולף הקלף מובטל/עצמאי/חסר חברים בעבודה, עליו לשתות צ'ייסר כפול ולהעביר את המשימה למשתתף הבא בסבב. ";
   array.push(obj);
   obj = {};
   obj.title="פדיחה מינית";//26
   obj.label = "שולף הקלף בוחר משתתף אחר ושניהם מספרים פדיחה מינית. המשתתף עם הפדיחה הפחות טובה, לדעת הרוב, שותה צ'ייסר";
   array.push(obj);
   obj = {};
   obj.title="אווירון אנושי";//27
   obj.label = "שולף הקלף בוחר משתתף אחר לעשות איתו אווירון אנושי. אם הם מצליחים לפחות ל-5 שניות, על שאר המשתתפים לסיים את הכוסות שלהם. אם לא הצליחו, עליהם לשתות צ'ייסר.";
   array.push(obj);
   obj = {};
   obj.title="תתערטל או תתמסטל";//28
   obj.label = "על שולף הקלף להוריד פריט לבוש או לשתות צ'ייסר כפול.";
   array.push(obj);
   obj = {};
   obj.title="הייתי עובר צד בשבילך";//29
   obj.label = "שולף הקלף בוחר משתתף אחר מאותו המגדר להתנשק איתו. אם שולף הקלף הוא המשתתף היחיד מהמגדר שלו - ברכותינו, אתם סוטים. תעשו צ'ייסר ולכו לטיפול.";
   array.push(obj);
   obj = {};
   obj.title="beer גוריון ";//30
   obj.label = "על שולף הקלף לשתות בירה בעמידת ידיים/עמידת ראש. אפשר להיעזר בקשית.";
   array.push(obj);
   obj = {};
   obj.title="חבילה עוברת";//31
   obj.label = "שולף הקלף שם מוזיקה מהטלפון ולא מסתכל על משתתפי המשחק בזמן שהם מעבירים ביניהם כוס צ'ייסר. כשמחליט, שולף הקלף עוצר את המוזיקה ומי שהכוס אצלו שותה צ'ייסר.";
   array.push(obj);
   obj = {};
      obj.title="bon appetit";//32
   obj.label = "על שולף הקלף ללקק את הרצפה ולתאר את הטעם כאילו הוא מתאר אוכל גורמה. המשתתף הראשון שצוחק שותה צ'ייסר. אם אף משתתף אינו צוחק, שולף הקלף צריך לשתות צ'ייסר.";
   array.push(obj);
   obj = {};
   obj.title="beer fight";//33
   obj.label = " שולף הקלף בוחר משתתף אחר לבצע מול קרב שתיית בירה. המשתתף שהפסיד מוריד פריט לבוש שבוחר המשתתף שניצח. *יש לוודא שכוסות הבירה של המתמודדים שוות.";
   array.push(obj);
   obj = {};
   obj.title="Celebration of positions";//34
   obj.label = "על שולף הקלף להדגים את תנוחת הסקס האהובה עליו עם המשתתף האחרון ששתה צ'ייסר.";
   array.push(obj);
   obj = {};
   obj.title="bodybuilder";//35
   obj.label = "על שולף הקלף לבצע 3 סקוואטים תוך שהוא עושה שק-קמח לאחרון ששתה צ’ייסר. במידה והוא לא מצליח, עליו לסיים את הבירה.";
   array.push(obj);
   obj = {};
   obj.title="מלחמת המוחות";//36
   obj.label = "שולף הקלף בוחר משתתף אחר. שניהם עומדים אחד מול השני עם ראשיהם למטה. כששולף הקלף מצביע לכיוון מסוים (למטה, למעלה, ימין או שמאל) על המשתתף מולו להפנות את ראשו בו זמנית. אם הוא הפנה את ראשו לאותו כיוון הוא שותה צ'ייסר. אם הפנה את ראשו לכיוון אחר הם מתחלפים בתפקידים וממשיכים עד שמישהו שותה צ'ייסר.";
   array.push(obj);
   obj = {};
   obj.title="fuck marry kill";//37
   obj.label = "על שולף הקלף לבחור עם איזה מבין המשתתפים הוא היה מזדיין, עם איזה היה מתחתן ואת איזה היה הורג. המשתתף שנבחר לזיון שותה צ’ייסר והמשתתף שנבחר למות מסיים את הבירה שלו.";
   array.push(obj);
   obj = {};
   obj.title="never have I ever";//38
   obj.label = "שולף הקלף אומר משהו שהוא לא עשה בחייו. כל משתתף שעשה זאת שותה צ’ייסר.";
   array.push(obj);
   obj = {};
   obj.title="צוחק מי שצוחק אחרון";//39
   obj.label = "מי שצוחק לוגם מהבירה. הקלף תקף למשך סיבוב שלם.";
   array.push(obj);
   obj = {};
   obj.title="Sticky hicky";//40
   obj.label = "שולף הקלף עושה היקי במקום יוצא דופן למשתתף האחרון ששתה צ'ייסר.";
   array.push(obj);
   obj = {};
   obj.title="Who's a good boy?";//41
   obj.label = "על שולף הקלף לשתות צ’ייסר כמו כלב במשך לפחות 10 לגימות. אם הוא מצליח לסיים את הצ’ייסר על כל שאר המשתתפים לסיים את הבירה שלהם";
   array.push(obj);
   obj = {};
      obj.title="Freezing panties";//42
   obj.label = "על שולף הקלף לשים קוביית קרח בתחתונים עד שהיא נמסה לגמרי.";
   array.push(obj);
   obj = {};
   obj.title="I have been naughty";//43
   obj.label = "שולף הקלף מקבל פליק מהמשתתף האחרון ששתה צ’ייסר.";
   array.push(obj);
   obj = {};
   obj.title="ear eating";//44
   obj.label = "על שולף הקלף ללקק בחושניות את התנוך של המשתתף האחרון ששתה צ'ייסר.";
   array.push(obj);
   obj = {};
   obj.title="קטגוריה מינית";//45
   obj.label = "שולף הקלף בוחר קטגוריה מינית, כגון: תנוחות, אביזרי מין וכו', ומתחיל סבב. האחרון שנתקע (חושב יותר מ-5 שניות) או חוזר על משהו שנאמר, שותה צ'ייסר.";
   array.push(obj);
   obj = {};
   obj.title="הכי שיכור";//46
   obj.label = "הכי שיכור, לפי דעת הרוב, מוריד פריט לבוש.";
   array.push(obj);
   obj.title="נשיקה סטירה";//47
   obj.label = "שולף הקלף והמשתתף האחרון ששתה צ'ייסר מתיישבים גב אל גב ומטים את ראשיהם לכיוון מסוים לפי ספירה. אם הם מטים את ראשם לאותו כיוון הם מתנשקים. אם הם מטים את ראשם לכיוונים מנוגדים אז שולף הקלף מקבל סטירה ושותה צ'ייסר ישר אחרי הסטירה.";
   array.push(obj);
   obj.title="fake it till’ you make it";//48
   obj.label = "שולף הקלף בוחר משתתף אחר לעשות מולו תחרות גניחות. המפסיד מסיים את הבירה. *אם הקלף יצא בתחילת המשחק, מומלץ להחזיר אותו לחבילה לשלב מאוחר יותר.";
   array.push(obj);
   obj.title="lap dance";//49
   obj.label = "על שולף הקלף לבצע לאפ דאנס על האחרון ששתה צ’ייסר למשך 20 שניות.";
   array.push(obj);
   obj.title="שלוק מגבוה";//50
   obj.label = "על שולף הקלף להטות את ראשו לאחור ולשתות שלוק מגובה של מטר לפחות.";
   array.push(obj);
   obj.title="what's your superpower?";//51
   obj.label = " על שולף הקלף לבצע משהו שרק הוא יודע לעשות. שאר המשתתפים יכולים לנסות לחקות אותו. אם מישהו מצליח, שולף הקלף שותה צ'ייסר כפול. אם אף אחד לא הצליח - על כל משתתפי המשחק, מלבד שולף הקלף, לשתות צ'ייסר";
   array.push(obj);

      return array;
}

window.TextButtons2=TextButtons2;
}(window)
)